
# pick only the plugins you want and remove the rest
# mattmc3/zephyr path:plugins/clipboard
mattmc3/zephyr path:plugins/color
mattmc3/zephyr path:plugins/completion
# mattmc3/zephyr path:plugins/confd
# mattmc3/zephyr path:plugins/directory
# mattmc3/zephyr path:plugins/editor
# mattmc3/zephyr path:plugins/environment
mattmc3/zephyr path:plugins/history
# mattmc3/zephyr path:plugins/homebrew
# mattmc3/zephyr path:plugins/macos
# mattmc3/zephyr path:plugins/prompt
mattmc3/zephyr path:plugins/terminal
mattmc3/zephyr path:plugins/utility
mattmc3/zephyr path:plugins/zfunctions

# popular fish-like plugins
mattmc3/zfunctions
zsh-users/zsh-autosuggestions
zdharma-continuum/fast-syntax-highlighting kind:defer
zsh-users/zsh-history-substring-search

zap-zsh/exa

#oh-my-zsh
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/kubectl
ohmyzsh/ohmyzsh path:plugins/kubectx
#ohmyzsh/ohmyzsh path:plugins/httpie
ohmyzsh/ohmyzsh path:plugins/lol
ohmyzsh/ohmyzsh path:plugins/node
ohmyzsh/ohmyzsh path:plugins/nvm
ohmyzsh/ohmyzsh path:plugins/sudo

Aloxaf/fzf-tab
